SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_sysrtc.h
/** @} End of group EFR32SG28_SYSRTC */

/**************************************************************************//**
 * @addtogroup EFR32SG28_SYSRTC
 * @{
 * @defgroup EFR32SG28_SYSRTC_BitFields SYSRTC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for SYSRTC IPVERSION */
#define _SYSRTC_IPVERSION_RESETVALUE            0x00000001UL                            /**< Default value for SYSRTC_IPVERSION          */
#define _SYSRTC_IPVERSION_MASK                  0xFFFFFFFFUL                            /**< Mask for SYSRTC_IPVERSION                   */
#define _SYSRTC_IPVERSION_IPVERSION_SHIFT       0                                       /**< Shift value for SYSRTC_IPVERSION            */
#define _SYSRTC_IPVERSION_IPVERSION_MASK        0xFFFFFFFFUL                            /**< Bit mask for SYSRTC_IPVERSION               */
#define _SYSRTC_IPVERSION_IPVERSION_DEFAULT     0x00000001UL                            /**< Mode DEFAULT for SYSRTC_IPVERSION           */
#define SYSRTC_IPVERSION_IPVERSION_DEFAULT      (_SYSRTC_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSRTC_IPVERSION   */

/* Bit fields for SYSRTC EN */
#define _SYSRTC_EN_RESETVALUE                   0x00000000UL                            /**< Default value for SYSRTC_EN                 */
#define _SYSRTC_EN_MASK                         0x00000003UL                            /**< Mask for SYSRTC_EN                          */
#define SYSRTC_EN_EN                            (0x1UL << 0)                            /**< SYSRTC Enable                               */
#define _SYSRTC_EN_EN_SHIFT                     0                                       /**< Shift value for SYSRTC_EN                   */
#define _SYSRTC_EN_EN_MASK                      0x1UL                                   /**< Bit mask for SYSRTC_EN                      */
#define _SYSRTC_EN_EN_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for SYSRTC_EN                  */
#define SYSRTC_EN_EN_DEFAULT                    (_SYSRTC_EN_EN_DEFAULT << 0)            /**< Shifted mode DEFAULT for SYSRTC_EN          */
#define SYSRTC_EN_DISABLING                     (0x1UL << 1)                            /**< Disablement busy status                     */
#define _SYSRTC_EN_DISABLING_SHIFT              1                                       /**< Shift value for SYSRTC_DISABLING            */
#define _SYSRTC_EN_DISABLING_MASK               0x2UL                                   /**< Bit mask for SYSRTC_DISABLING               */
#define _SYSRTC_EN_DISABLING_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SYSRTC_EN                  */
#define SYSRTC_EN_DISABLING_DEFAULT             (_SYSRTC_EN_DISABLING_DEFAULT << 1)     /**< Shifted mode DEFAULT for SYSRTC_EN          */

/* Bit fields for SYSRTC SWRST */
#define _SYSRTC_SWRST_RESETVALUE                0x00000000UL                            /**< Default value for SYSRTC_SWRST              */
#define _SYSRTC_SWRST_MASK                      0x00000003UL                            /**< Mask for SYSRTC_SWRST                       */
#define SYSRTC_SWRST_SWRST                      (0x1UL << 0)                            /**< Software reset command                      */
#define _SYSRTC_SWRST_SWRST_SHIFT               0                                       /**< Shift value for SYSRTC_SWRST                */
#define _SYSRTC_SWRST_SWRST_MASK                0x1UL                                   /**< Bit mask for SYSRTC_SWRST                   */
#define _SYSRTC_SWRST_SWRST_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for SYSRTC_SWRST               */
#define SYSRTC_SWRST_SWRST_DEFAULT              (_SYSRTC_SWRST_SWRST_DEFAULT << 0)      /**< Shifted mode DEFAULT for SYSRTC_SWRST       */
#define SYSRTC_SWRST_RESETTING                  (0x1UL << 1)                            /**< Software reset busy status                  */
#define _SYSRTC_SWRST_RESETTING_SHIFT           1                                       /**< Shift value for SYSRTC_RESETTING            */
#define _SYSRTC_SWRST_RESETTING_MASK            0x2UL                                   /**< Bit mask for SYSRTC_RESETTING               */
#define _SYSRTC_SWRST_RESETTING_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for SYSRTC_SWRST               */
#define SYSRTC_SWRST_RESETTING_DEFAULT          (_SYSRTC_SWRST_RESETTING_DEFAULT << 1)  /**< Shifted mode DEFAULT for SYSRTC_SWRST       */

/* Bit fields for SYSRTC CFG */
#define _SYSRTC_CFG_RESETVALUE                  0x00000000UL                            /**< Default value for SYSRTC_CFG                */
#define _SYSRTC_CFG_MASK                        0x00000001UL                            /**< Mask for SYSRTC_CFG                         */
#define SYSRTC_CFG_DEBUGRUN                     (0x1UL << 0)                            /**< Debug Mode Run Enable                       */
#define _SYSRTC_CFG_DEBUGRUN_SHIFT              0                                       /**< Shift value for SYSRTC_DEBUGRUN             */
#define _SYSRTC_CFG_DEBUGRUN_MASK               0x1UL                                   /**< Bit mask for SYSRTC_DEBUGRUN                */
#define _SYSRTC_CFG_DEBUGRUN_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SYSRTC_CFG                 */
#define _SYSRTC_CFG_DEBUGRUN_DISABLE            0x00000000UL                            /**< Mode DISABLE for SYSRTC_CFG                 */
#define _SYSRTC_CFG_DEBUGRUN_ENABLE             0x00000001UL                            /**< Mode ENABLE for SYSRTC_CFG                  */
#define SYSRTC_CFG_DEBUGRUN_DEFAULT             (_SYSRTC_CFG_DEBUGRUN_DEFAULT << 0)     /**< Shifted mode DEFAULT for SYSRTC_CFG         */
#define SYSRTC_CFG_DEBUGRUN_DISABLE             (_SYSRTC_CFG_DEBUGRUN_DISABLE << 0)     /**< Shifted mode DISABLE for SYSRTC_CFG         */
#define SYSRTC_CFG_DEBUGRUN_ENABLE              (_SYSRTC_CFG_DEBUGRUN_ENABLE << 0)      /**< Shifted mode ENABLE for SYSRTC_CFG          */

/* Bit fields for SYSRTC CMD */
#define _SYSRTC_CMD_RESETVALUE                  0x00000000UL                            /**< Default value for SYSRTC_CMD                */
#define _SYSRTC_CMD_MASK                        0x00000003UL                            /**< Mask for SYSRTC_CMD                         */
#define SYSRTC_CMD_START                        (0x1UL << 0)                            /**< Start SYSRTC                                */
#define _SYSRTC_CMD_START_SHIFT                 0                                       /**< Shift value for SYSRTC_START                */
#define _SYSRTC_CMD_START_MASK                  0x1UL                                   /**< Bit mask for SYSRTC_START                   */
#define _SYSRTC_CMD_START_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for SYSRTC_CMD                 */
#define SYSRTC_CMD_START_DEFAULT                (_SYSRTC_CMD_START_DEFAULT << 0)        /**< Shifted mode DEFAULT for SYSRTC_CMD         */
#define SYSRTC_CMD_STOP                         (0x1UL << 1)                            /**< Stop SYSRTC                                 */
#define _SYSRTC_CMD_STOP_SHIFT                  1                                       /**< Shift value for SYSRTC_STOP                 */
#define _SYSRTC_CMD_STOP_MASK                   0x2UL                                   /**< Bit mask for SYSRTC_STOP                    */
#define _SYSRTC_CMD_STOP_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for SYSRTC_CMD                 */
#define SYSRTC_CMD_STOP_DEFAULT                 (_SYSRTC_CMD_STOP_DEFAULT << 1)         /**< Shifted mode DEFAULT for SYSRTC_CMD         */

/* Bit fields for SYSRTC STATUS */
#define _SYSRTC_STATUS_RESETVALUE               0x00000000UL                            /**< Default value for SYSRTC_STATUS             */
#define _SYSRTC_STATUS_MASK                     0x00000007UL                            /**< Mask for SYSRTC_STATUS                      */
#define SYSRTC_STATUS_RUNNING                   (0x1UL << 0)                            /**< SYSRTC running status                       */
#define _SYSRTC_STATUS_RUNNING_SHIFT            0                                       /**< Shift value for SYSRTC_RUNNING              */
#define _SYSRTC_STATUS_RUNNING_MASK             0x1UL                                   /**< Bit mask for SYSRTC_RUNNING                 */
#define _SYSRTC_STATUS_RUNNING_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for SYSRTC_STATUS              */
#define SYSRTC_STATUS_RUNNING_DEFAULT           (_SYSRTC_STATUS_RUNNING_DEFAULT << 0)   /**< Shifted mode DEFAULT for SYSRTC_STATUS      */
#define SYSRTC_STATUS_LOCKSTATUS                (0x1UL << 1)                            /**< Lock Status                                 */
#define _SYSRTC_STATUS_LOCKSTATUS_SHIFT         1                                       /**< Shift value for SYSRTC_LOCKSTATUS           */
#define _SYSRTC_STATUS_LOCKSTATUS_MASK          0x2UL                                   /**< Bit mask for SYSRTC_LOCKSTATUS              */
#define _SYSRTC_STATUS_LOCKSTATUS_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for SYSRTC_STATUS              */
#define _SYSRTC_STATUS_LOCKSTATUS_UNLOCKED      0x00000000UL                            /**< Mode UNLOCKED for SYSRTC_STATUS             */
#define _SYSRTC_STATUS_LOCKSTATUS_LOCKED        0x00000001UL                            /**< Mode LOCKED for SYSRTC_STATUS               */
#define SYSRTC_STATUS_LOCKSTATUS_DEFAULT        (_SYSRTC_STATUS_LOCKSTATUS_DEFAULT << 1) /**< Shifted mode DEFAULT for SYSRTC_STATUS      */
#define SYSRTC_STATUS_LOCKSTATUS_UNLOCKED       (_SYSRTC_STATUS_LOCKSTATUS_UNLOCKED << 1) /**< Shifted mode UNLOCKED for SYSRTC_STATUS     */
#define SYSRTC_STATUS_LOCKSTATUS_LOCKED         (_SYSRTC_STATUS_LOCKSTATUS_LOCKED << 1) /**< Shifted mode LOCKED for SYSRTC_STATUS       */

/* Bit fields for SYSRTC CNT */
#define _SYSRTC_CNT_RESETVALUE                  0x00000000UL                            /**< Default value for SYSRTC_CNT                */
#define _SYSRTC_CNT_MASK                        0xFFFFFFFFUL                            /**< Mask for SYSRTC_CNT                         */
#define _SYSRTC_CNT_CNT_SHIFT                   0                                       /**< Shift value for SYSRTC_CNT                  */
#define _SYSRTC_CNT_CNT_MASK                    0xFFFFFFFFUL                            /**< Bit mask for SYSRTC_CNT                     */
#define _SYSRTC_CNT_CNT_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for SYSRTC_CNT                 */
#define SYSRTC_CNT_CNT_DEFAULT                  (_SYSRTC_CNT_CNT_DEFAULT << 0)          /**< Shifted mode DEFAULT for SYSRTC_CNT         */

/* Bit fields for SYSRTC SYNCBUSY */
#define _SYSRTC_SYNCBUSY_RESETVALUE             0x00000000UL                            /**< Default value for SYSRTC_SYNCBUSY           */
#define _SYSRTC_SYNCBUSY_MASK                   0x0000000FUL                            /**< Mask for SYSRTC_SYNCBUSY                    */
#define SYSRTC_SYNCBUSY_START                   (0x1UL << 0)                            /**< Sync busy for START bitfield                */
#define _SYSRTC_SYNCBUSY_START_SHIFT            0                                       /**< Shift value for SYSRTC_START                */
#define _SYSRTC_SYNCBUSY_START_MASK             0x1UL                                   /**< Bit mask for SYSRTC_START                   */
#define _SYSRTC_SYNCBUSY_START_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for SYSRTC_SYNCBUSY            */
#define SYSRTC_SYNCBUSY_START_DEFAULT           (_SYSRTC_SYNCBUSY_START_DEFAULT << 0)   /**< Shifted mode DEFAULT for SYSRTC_SYNCBUSY    */
#define SYSRTC_SYNCBUSY_STOP                    (0x1UL << 1)                            /**< Sync busy for STOP bitfield                 */
#define _SYSRTC_SYNCBUSY_STOP_SHIFT             1                                       /**< Shift value for SYSRTC_STOP                 */
#define _SYSRTC_SYNCBUSY_STOP_MASK              0x2UL                                   /**< Bit mask for SYSRTC_STOP                    */
#define _SYSRTC_SYNCBUSY_STOP_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SYSRTC_SYNCBUSY            */
#define SYSRTC_SYNCBUSY_STOP_DEFAULT            (_SYSRTC_SYNCBUSY_STOP_DEFAULT << 1)    /**< Shifted mode DEFAULT for SYSRTC_SYNCBUSY    */
#define SYSRTC_SYNCBUSY_CNT                     (0x1UL << 2)                            /**< Sync busy for CNT bitfield                  */
#define _SYSRTC_SYNCBUSY_CNT_SHIFT              2                                       /**< Shift value for SYSRTC_CNT                  */
#define _SYSRTC_SYNCBUSY_CNT_MASK               0x4UL                                   /**< Bit mask for SYSRTC_CNT                     */
#define _SYSRTC_SYNCBUSY_CNT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SYSRTC_SYNCBUSY            */
#define SYSRTC_SYNCBUSY_CNT_DEFAULT             (_SYSRTC_SYNCBUSY_CNT_DEFAULT << 2)     /**< Shifted mode DEFAULT for SYSRTC_SYNCBUSY    */

/* Bit fields for SYSRTC LOCK */
#define _SYSRTC_LOCK_RESETVALUE                 0x00000000UL                            /**< Default value for SYSRTC_LOCK               */
#define _SYSRTC_LOCK_MASK                       0x0000FFFFUL                            /**< Mask for SYSRTC_LOCK                        */
#define _SYSRTC_LOCK_LOCKKEY_SHIFT              0                                       /**< Shift value for SYSRTC_LOCKKEY              */
#define _SYSRTC_LOCK_LOCKKEY_MASK               0xFFFFUL                                /**< Bit mask for SYSRTC_LOCKKEY                 */
#define _SYSRTC_LOCK_LOCKKEY_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SYSRTC_LOCK                */
#define _SYSRTC_LOCK_LOCKKEY_UNLOCK             0x00004776UL                            /**< Mode UNLOCK for SYSRTC_LOCK                 */
#define SYSRTC_LOCK_LOCKKEY_DEFAULT             (_SYSRTC_LOCK_LOCKKEY_DEFAULT << 0)     /**< Shifted mode DEFAULT for SYSRTC_LOCK        */
#define SYSRTC_LOCK_LOCKKEY_UNLOCK              (_SYSRTC_LOCK_LOCKKEY_UNLOCK << 0)      /**< Shifted mode UNLOCK for SYSRTC_LOCK         */

/* Bit fields for SYSRTC GRP0_IF */
#define _SYSRTC_GRP0_IF_RESETVALUE              0x00000000UL                            /**< Default value for SYSRTC_GRP0_IF            */
#define _SYSRTC_GRP0_IF_MASK                    0x0000000FUL                            /**< Mask for SYSRTC_GRP0_IF                     */
#define SYSRTC_GRP0_IF_OVF                      (0x1UL << 0)                            /**< Overflow Interrupt Flag                     */
#define _SYSRTC_GRP0_IF_OVF_SHIFT               0                                       /**< Shift value for SYSRTC_OVF                  */
#define _SYSRTC_GRP0_IF_OVF_MASK                0x1UL                                   /**< Bit mask for SYSRTC_OVF                     */
#define _SYSRTC_GRP0_IF_OVF_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for SYSRTC_GRP0_IF             */
#define SYSRTC_GRP0_IF_OVF_DEFAULT              (_SYSRTC_GRP0_IF_OVF_DEFAULT << 0)      /**< Shifted mode DEFAULT for SYSRTC_GRP0_IF     */
#define SYSRTC_GRP0_IF_CMP0                     (0x1UL << 1)                            /**< Compare 0 Interrupt Flag                    */
#define _SYSRTC_GRP0_IF_CMP0_SHIFT              1                                       /**< Shift value for SYSRTC_CMP0                 */
#define _SYSRTC_GRP0_IF_CMP0_MASK               0x2UL                                   /**< Bit mask for SYSRTC_CMP0                    */
#define _SYSRTC_GRP0_IF_CMP0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SYSRTC_GRP0_IF             */
#define SYSRTC_GRP0_IF_CMP0_DEFAULT             (_SYSRTC_GRP0_IF_CMP0_DEFAULT << 1)     /**< Shifted mode DEFAULT for SYSRTC_GRP0_IF     */
#define SYSRTC_GRP0_IF_CMP1                     (0x1UL << 2)                            /**< Compare 1 Interrupt Flag                    */
#define _SYSRTC_GRP0_IF_CMP1_SHIFT              2                                       /**< Shift value for SYSRTC_CMP1                 */
#define _SYSRTC_GRP0_IF_CMP1_MASK               0x4UL                                   /**< Bit mask for SYSRTC_CMP1                    */
#define _SYSRTC_GRP0_IF_CMP1_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SYSRTC_GRP0_IF             */
#define SYSRTC_GRP0_IF_CMP1_DEFAULT             (_SYSRTC_GRP0_IF_CMP1_DEFAULT << 2)     /**< Shifted mode DEFAULT for SYSRTC_GRP0_IF     */
#define SYSRTC_GRP0_IF_CAP0                     (0x1UL << 3)                            /**< Capture 0 Interrupt Flag                    */
#define _SYSRTC_GRP0_IF_CAP0_SHIFT              3                                       /**< Shift value for SYSRTC_CAP0                 */
#define _SYSRTC_GRP0_IF_CAP0_MASK               0x8UL                                   /**< Bit mask for SYSRTC_CAP0                    */
#define _SYSRTC_GRP0_IF_CAP0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SYSRTC_GRP0_IF             */
#define SYSRTC_GRP0_IF_CAP0_DEFAULT             (_SYSRTC_GRP0_IF_CAP0_DEFAULT << 3)     /**< Shifted mode DEFAULT for SYSRTC_GRP0_IF     */

/* Bit fields for SYSRTC GRP0_IEN */
#define _SYSRTC_GRP0_IEN_RESETVALUE             0x00000000UL                            /**< Default value for SYSRTC_GRP0_IEN           */
#define _SYSRTC_GRP0_IEN_MASK                   0x0000000FUL                            /**< Mask for SYSRTC_GRP0_IEN                    */
#define SYSRTC_GRP0_IEN_OVF                     (0x1UL << 0)                            /**< Overflow Interrupt Enable                   */
#define _SYSRTC_GRP0_IEN_OVF_SHIFT              0                                       /**< Shift value for SYSRTC_OVF                  */
#define _SYSRTC_GRP0_IEN_OVF_MASK               0x1UL                                   /**< Bit mask for SYSRTC_OVF                     */
#define _SYSRTC_GRP0_IEN_OVF_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for SYSRTC_GRP0_IEN            */
#define SYSRTC_GRP0_IEN_OVF_DEFAULT             (_SYSRTC_GRP0_IEN_OVF_DEFAULT << 0)     /**< Shifted mode DEFAULT for SYSRTC_GRP0_IEN    */
#define SYSRTC_GRP0_IEN_CMP0                    (0x1UL << 1)                            /**< Compare 0 Interrupt Enable                  */
#define _SYSRTC_GRP0_IEN_CMP0_SHIFT             1                                       /**< Shift value for SYSRTC_CMP0                 */
#define _SYSRTC_GRP0_IEN_CMP0_MASK              0x2UL                                   /**< Bit mask for SYSRTC_CMP0                    */
#define _SYSRTC_GRP0_IEN_CMP0_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SYSRTC_GRP0_IEN            */
#define SYSRTC_GRP0_IEN_CMP0_DEFAULT            (_SYSRTC_GRP0_IEN_CMP0_DEFAULT << 1)    /**< Shifted mode DEFAULT for SYSRTC_GRP0_IEN    */
#define SYSRTC_GRP0_IEN_CMP1                    (0x1UL << 2)                            /**< Compare 1 Interrupt Enable                  */
#define _SYSRTC_GRP0_IEN_CMP1_SHIFT             2                                       /**< Shift value for SYSRTC_CMP1                 */
#define _SYSRTC_GRP0_IEN_CMP1_MASK              0x4UL                                   /**< Bit mask for SYSRTC_CMP1                    */
#define _SYSRTC_GRP0_IEN_CMP1_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SYSRTC_GRP0_IEN            */
#define SYSRTC_GRP0_IEN_CMP1_DEFAULT            (_SYSRTC_GRP0_IEN_CMP1_DEFAULT << 2)    /**< Shifted mode DEFAULT for SYSRTC_GRP0_IEN    */
#define SYSRTC_GRP0_IEN_CAP0                    (0x1UL << 3)                            /**< Capture 0 Interrupt Enable                  */
#define _SYSRTC_GRP0_IEN_CAP0_SHIFT             3                                       /**< Shift value for SYSRTC_CAP0                 */
#define _SYSRTC_GRP0_IEN_CAP0_MASK              0x8UL                                   /**< Bit mask for SYSRTC_CAP0                    */
#define _SYSRTC_GRP0_IEN_CAP0_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for SYSRTC_GRP0_IEN            */
#define SYSRTC_GRP0_IEN_CAP0_DEFAULT            (_SYSRTC_GRP0_IEN_CAP0_DEFAULT << 3)    /**< Shifted mode DEFAULT for SYSRTC_GRP0_IEN    */

